#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ChrisWilding/terraform-github/runs/run-CeGVBPQzW7Foc4jC

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.bump: Refreshing state... [id=bump]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.clox: Refreshing state... [id=clox]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.bill: Refreshing state... [id=bill]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_actions_secret.go_base_heroku_api_key: Refreshing state... [id=go-base:HEROKU_API_KEY]
github_actions_secret.go_base_terraform_cloud_api_key: Refreshing state... [id=go-base:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.heroku_api_key: Refreshing state... [id=jinventory:HEROKU_API_KEY]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_actions_secret.magidash_heroku_api_key: Refreshing state... [id=magidash:HEROKU_API_KEY]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.curriculum_vitae has changed
  ~ resource "github_repository" "curriculum_vitae" {
      ~ etag                   = "W/\"dfe376e73d470b2a398c2bbea048e8662fd545bdb9d8f08203ece9ce4ee84ff6\"" -> "W/\"0da25831e15751923521ea32dc12d5df0d85713752637e68d9826a04f50d3b3b\""
        id                     = "curriculum-vitae"
        name                   = "curriculum-vitae"
        # (27 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.crawl will be created
  + resource "github_repository" "crawl" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + license_template       = "apache-2.0"
      + name                   = "crawl"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @ChrisWilding, Action: `pull_request`*